import sys
import os

pwd = os.path.dirname(os.path.realpath(__file__))
sys.path.append(pwd + "../")
os.environ.setdefault("DJANGO_SETTINGS_MODULE", "Jk152.settings")

import django

django.setup()

from jk.models import Img, Per

img_list = []
for i in range(1, 429):
    img = Img()
    img.sn = i
    img_list.append(img)

Img.objects.bulk_create(img_list)


per_data = {
    "120133101050": "林程宇",
    "120143101009": "王智慧",
    "120143101019": "乔宝静",
    "120153101013": "付鹏飞",
    "120153101037": "张明宇",
    "120153101010": "王峰兴",
    "120153101040": "张晓凯",
    "120153101012": "韦博文",
    "120153101003": "马小文",
    "120153101008": "王存栋",
    "120153101062": "周歆芸",
    "120153101028": "闫丽影",
    "120153101038": "张松",
    "120153101021": "刘云婷",
    "120153101002": "于海涛",
    "120153101042": "李丹丹",
    "120153101025": "孙浩",
    "120153101031": "佟奇儒",
    "120153101034": "宋国强",
    "120153101004": "马宏硕",
    "120153101052": "杜晓雨",
    "120153101018": "白如霞",
    "120153101001": "万东梅",
    "120153101011": "王晗",
    "120153101029": "闫明爽",
    "120153101065": "姜伟",
    "120153101057": "陈立新",
    "120153101015": "叶子琛",
    "120153101006": "孔伟祥",
    "120153101071": "索维",
    "120153101078": "解皓歌",
    "120153101056": "陈冬",
    "120153101035": "宋金林",
    "120153101077": "谢启明",
    "120153101048": "李明亮",
    "120153101070": "赵鹏",
    "120153101064": "林东",
    "120153101066": "段正方",
    "120153101009": "王保强",
    "120153101017": "申伟生",

}


per_list = []
for k,v in per_data.items():
    per = Per()
    per.username = v
    per.password = k
    per_list.append(per)
Per.objects.bulk_create(per_list)